#ДЗ понедельник:
# Файл называем Chebeyko_Sergey_Lesson_1.py
# Вывести на печать сумму, разность и произведение двух переменных
# Сдать работу до понедельника

input("Сумма, разность и произведение двух переменных")
a = float(input("вывести первое число:"))

b = int(input("Вывести второе число:"))

sum = a + b
razn = a - b
proiz = a * b

print("Сумма =", sum )
print("Разность=", razn)
print("Произведение =", proiz)